RAKWireless/RAK-nRF52-RUI/cores/nRF5/component/core/mcu/nrf52840/uhal/uhal_ble_hid.c
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};
static bool              erase_bonds;

static uint8_t m_sample_key_press_scan_str[] =                          /**< Key pattern to be sent when the key press button has been pushed. */
{
    0x0b,       /* Key h */
    0x08,       /* Key e */
    0x0f,       /* Key l */
    0x0f,       /* Key l */
    0x12,       /* Key o */
    0x28        /* Key Return */
};

static uint8_t m_caps_on_key_scan_str[] =                               /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit set. */
{
    0x06,       /* Key C */
    0x04,       /* Key a */
    0x13,       /* Key p */
    0x16,       /* Key s */
    0x12,       /* Key o */
    0x11,       /* Key n */
};

static uint8_t m_caps_off_key_scan_str[] =                              /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit cleared. */
{
    0x06,       /* Key C */
    0x04,       /* Key a */
    0x13,       /* Key p */
    0x16,       /* Key s */
    0x12,       /* Key o */
    0x09,       /* Key f */
};

extern uint8_t ble_current_service;

extern struct uhal_ble_parameter ble_parameter;

extern int uhal_is_advertising;

ble_advertising_init_t hid_adv_init;

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);


static void (*KEYBOARD_REPORT_HANDLER)(uint16_t, uint8_t);

void uhal_ble_keyboard_handler(BLE_KEYBOARD_HANDLER handler)
{
    KEYBOARD_REPORT_HANDLER = handler;
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    NRF_LOG_ERROR("%s:%d", p_file_name, line_num);
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for setting filtered whitelist.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void whitelist_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint32_t     peer_id_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
                   peer_id_count + 1,
                   BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

    err_code = pm_whitelist_set(peer_ids, peer_id_count);
    NRF_LOG_DEBUG("(HID)whitelist_set : %d", err_code);
    //APP_ERROR_CHECK(err_code);
    if(err_code != NRF_SUCCESS)
        uhal_ble_delete_bonds();
}


/**@brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
    uint32_t     peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}


/**@brief Clear bond information from persistent storage.
 */
void uhal_ble_delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
int32_t uhal_ble_hid_advertising_start()
{
    ret_code_t err_code;
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("(HID) erase_bonds = %d", erase_bonds);
        erase_bonds = false;
        uhal_ble_delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {

        NRF_LOG_INFO("HID Keyboard started (ble_current_service): %d ",ble_current_service);
        if(uhal_is_advertising)
        {
            err_code = sd_ble_gap_adv_stop((&m_hid_advertising)->adv_handle);
            NRF_LOG_DEBUG("(HID) Stop Advertising. : %d", err_code);
        }
        err_code = sd_ble_gap_tx_power_set(1, (&m_hid_advertising)->adv_handle, ble_parameter.txpower);
        NRF_LOG_DEBUG("(HID) Set TX Power : %x", err_code);

        if (ble_parameter.adv_mode == DRV_BLE_ADV_MODE_FAST)
        {
            NRF_LOG_DEBUG("(HID) DRV_BLE_ADV_MODE_FAST");
            hid_adv_init.config.ble_adv_slow_enabled = false;
            hid_adv_init.config.ble_adv_fast_enabled = true;
            hid_adv_init.config.ble_adv_fast_interval = ble_parameter.adv_interval;
            hid_adv_init.config.ble_adv_fast_timeout = ble_parameter.adv_timeout * 100;
        }
        else if (ble_parameter.adv_mode == DRV_BLE_ADV_MODE_SLOW)
        {
            NRF_LOG_DEBUG("(HID) DRV_BLE_ADV_MODE_SLOW");
            hid_adv_init.config.ble_adv_fast_enabled = false;
            hid_adv_init.config.ble_adv_slow_enabled = true;
            hid_adv_init.config.ble_adv_slow_interval = ble_parameter.adv_interval;
            hid_adv_init.config.ble_adv_slow_timeout = ble_parameter.adv_timeout * 100;
        }
        
        NRF_LOG_DEBUG("(HID) advertising interval = %d (ms)", ble_parameter.adv_interval * 0.625) ;
        NRF_LOG_DEBUG("(HID) advertising timeout = %d (sec)", ble_parameter.adv_timeout);
        
        
        if (m_hid_conn_handle == BLE_CONN_HANDLE_INVALID)
        {
            ble_advertising_modes_config_set(&m_hid_advertising, &hid_adv_init.config);
        
            whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
            //whitelist_set(PM_PEER_ID_LIST_SKIP_NO_IRK);

