RAKWireless/RAK-nRF52-RUI/cores/nRF5/component/core/mcu/nrf52840/uhal/uhal_ble_hid.c
            err_code = ble_advertising_start(&m_hid_advertising, ble_parameter.adv_mode);
            NRF_LOG_DEBUG("(HID) Start Advertising. : %x", err_code);
            APP_ERROR_CHECK(err_code);
        }

        return err_code;
        
    }
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_hid_evt_handler(pm_evt_t const * p_evt)
{
    //NRF_LOG_DEBUG("(A1)----------pm_hid_evt_handler :p_evt->evt_id =%d", p_evt->evt_id);
    //NRF_LOG_DEBUG("(A2)----------pm_hid_evt_handler :p_evt->peer_id =%d", p_evt->peer_id);

    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);
    
    switch (p_evt->evt_id)
    {
        case PM_EVT_CONN_SEC_SUCCEEDED:
            m_peer_id = p_evt->peer_id;
            break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            NRF_LOG_DEBUG("----------PM_EVT_PEERS_DELETE_SUCCEEDED :p_evt->peer_id =%d",  p_evt->peer_id);
            uhal_ble_hid_advertising_start();
            break;
        case PM_EVT_PEER_DELETE_SUCCEEDED:
            NRF_LOG_DEBUG("----------PM_EVT_PEER_DELETE_SUCCEEDED :p_evt->peer_id =%d",  p_evt->peer_id);
            break;
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
            if (     p_evt->params.peer_data_update_succeeded.flash_changed
                 && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING))
            {
                NRF_LOG_INFO("New Bond, add the peer to the whitelist if possible");
                // Note: You should check on what kind of white list policy your application should use.

                whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
            }
            break;
        case PM_EVT_CONN_SEC_CONFIG_REQ:
            NRF_LOG_DEBUG("-----------------Security configuration request");
            conn_sec_config.allow_repairing = true;
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
            break;
        default:
            break;
    }
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    ret_code_t err_code;
    uint8_t  battery_level;
    if (m_hid_conn_handle == BLE_CONN_HANDLE_INVALID)
        return;

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_FORBIDDEN) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        NRF_LOG_DEBUG("(HID)battery_level_update err_code : %d", err_code);
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_create_battery(void)
{
    ret_code_t err_code;

    //err_code = app_timer_init();
    //APP_ERROR_CHECK(err_code);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    char set_dev_name[30];
    ble_gap_addr_t gap_addr;

    err_code = sd_ble_gap_addr_get(&gap_addr);
    APP_ERROR_CHECK(err_code);

    sprintf(set_dev_name, "%s.%02X%02X%02X", ble_parameter.custom_dev_name,
                                                              /*gap_addr.addr[5],
															    gap_addr.addr[4],
																gap_addr.addr[3],*/
            gap_addr.addr[2],
            gap_addr.addr[1],
            gap_addr.addr[0]);


    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)set_dev_name,
                                          strlen(set_dev_name));
    APP_ERROR_CHECK(err_code);

    strncpy(ble_parameter.custom_dev_name, set_dev_name, sizeof(ble_parameter.custom_dev_name));

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_KEYBOARD);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_hid_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Queued Write Module.
 */
static void qwr_init(void)
{
    ret_code_t         err_code;
    nrf_ble_qwr_init_t qwr_init_obj = {0};

    qwr_init_obj.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_hid_qwr, &qwr_init_obj);
    APP_ERROR_CHECK(err_code);
}


