RAKWireless/RAK-nRF52-RUI/cores/nRF5/component/core/mcu/nrf52840/uhal/uhal_ble_hid.c
    memset(&hid_adv_init, 0, sizeof(hid_adv_init));

    adv_flags                                              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    hid_adv_init.advdata.name_type                         = BLE_ADVDATA_FULL_NAME;
    hid_adv_init.advdata.include_appearance                = true;
    hid_adv_init.advdata.flags                             = adv_flags;
    hid_adv_init.advdata.uuids_complete.uuid_cnt           = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    hid_adv_init.advdata.uuids_complete.p_uuids            = m_adv_uuids;

    hid_adv_init.config.ble_adv_whitelist_enabled          = true;
    hid_adv_init.config.ble_adv_directed_high_duty_enabled = true;
    hid_adv_init.config.ble_adv_directed_enabled           = false;
    hid_adv_init.config.ble_adv_directed_interval          = 0;
    hid_adv_init.config.ble_adv_directed_timeout           = 0;
    hid_adv_init.config.ble_adv_fast_enabled               = true;
    hid_adv_init.config.ble_adv_fast_interval              = APP_ADV_FAST_INTERVAL;
    hid_adv_init.config.ble_adv_fast_timeout               = APP_ADV_FAST_DURATION;
    //hid_adv_init.config.ble_adv_slow_enabled               = true;
    //hid_adv_init.config.ble_adv_slow_interval              = APP_ADV_SLOW_INTERVAL;
    //hid_adv_init.config.ble_adv_slow_timeout               = APP_ADV_SLOW_DURATION;

    hid_adv_init.evt_handler   = hid_on_adv_evt;
    hid_adv_init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_hid_advertising, &hid_adv_init);
    NRF_LOG_DEBUG("(HID) Advertising init  = %d ", err_code);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_hid_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEBUG("----------startup_event : %d", startup_event);
    NRF_LOG_DEBUG("----------BSP_EVENT_CLEAR_BONDING_DATA : %d", BSP_EVENT_CLEAR_BONDING_DATA);
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
    NRF_LOG_DEBUG("----------p_erase_bonds : %d", *p_erase_bonds);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    app_sched_execute();
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

void uhal_ble_hid_init()
{
    timers_create_battery();
    //buttons_leds_init(&erase_bonds);
    //NRF_LOG_INFO("(1)----- erase_bonds = %d", erase_bonds);
    //power_management_init();
    hid_ble_stack_init();
    //scheduler_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    buffer_init();
    //erase_bonds = true;
    peer_manager_init();
    timers_start();
}

/**@brief Function for application main entry.

int main(void)
{
    // Initialize.
    //log_init();

    timers_init();
    buttons_leds_init(&erase_bonds);
    NRF_LOG_INFO("(1)----- erase_bonds = %d", erase_bonds);
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    buffer_init();
    //erase_bonds = true;

    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("HID Keyboard example started.");

    timers_start();
    uhal_ble_hid_advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}
*/

#endif
